2018/06/19.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2018-07-26 목 10:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Hupyeong Lee">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">2018-06-19</h2>
<div class="outline-text-2" id="text-1">
<p>
단순한 검색은 C-s 명령 다음 검색어를 입력하면 된다. 검색어와 일치하는 대상은
강조되어 보여지고 C-s 를 반복할 때마다 다음 대상으로 이동한다. 이전 위치로
이동하고 싶을 때에는 C-r 명령을 사용할 수 있다. 처음부터 C-r 로 검색해도 된다.
해당 위치에서 검색을 마치고 싶을 때에는 RET 키를 누르면 된다. C-g 명령으로
검색을 취소한 경우 검색 전에 있던 포인트로 돌아간다. 정규 표현식을 사용해서
찾기 시작하려면 Meta 키를 조합하여 C-M-s, C-M-r 로 명령을 호출하면 된다. 검색
중 언제라도 M-p, M-n 으로 히스토리에 있는 검색어를 사용할 수 있다. 검색어와
일치하는 대상들을 바꾸고 싶을 때에는 M-% 명령을 사용해서 미니버퍼에 내용을
입력해주면 된다. 검색 결과에 대해 치환 여부를 물어볼 때 y, n 키를 통해 하나씩
바꾸거나 넘어갈 수 있다. ? 키로 모두 치환이나 되돌리기 등의 다른 기능들의
도움말을 볼 수 있다. 정규표현식을 사용해서 바꾸는 명령은 M-C-% 인데 바인딩 된
키 입력이 불편할 때에는 M-x 명령으로 query-replace-regexp 를 직접 호출한다.
</p>

<p>
숫자를 사용하여 특정 줄로 포인트를 옮기고 싶을 때에는 M-g g 명령을 사용한다.
잘 쓰이진 않지만 줄 대신 글자를 단위로 사용하는 M-g c 명령도 있다.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">오늘의 명령 모음</h3>
<div class="outline-text-3" id="text-1-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Key</th>
<th scope="col" class="text-left">Function</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">C-s</td>
<td class="text-left">isearch-forward</td>
</tr>

<tr>
<td class="text-left">C-r</td>
<td class="text-left">isearch-backward</td>
</tr>

<tr>
<td class="text-left">C-M-s</td>
<td class="text-left">isearch-forward-regexp</td>
</tr>

<tr>
<td class="text-left">C-M-r</td>
<td class="text-left">isearch-backward-regexp</td>
</tr>

<tr>
<td class="text-left">M-%</td>
<td class="text-left">query-replace</td>
</tr>

<tr>
<td class="text-left">M-C-%</td>
<td class="text-left">query-replace-regexp</td>
</tr>

<tr>
<td class="text-left">M-g g</td>
<td class="text-left">goto-line</td>
</tr>

<tr>
<td class="text-left">M-g c</td>
<td class="text-left">goto-char</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">2018-06-19</a>
<ul class="nav">
<li><a href="#sec-1-1">오늘의 명령 모음</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Hupyeong Lee</p>
<p class="date">Created: 2018-07-26 목 10:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.9)</p>
</div>
</footer>
</body>
</html>
